app/Controllers/api/CustomerController.php

SELECT *
FROM `users`
WHERE `id` = ''
SELECT *
FROM `countries`
WHERE `id` = '101'
 LIMIT 1
SELECT *
FROM `states`
WHERE `id` = '35'
 LIMIT 1
SELECT *
FROM `cities`
WHERE `id` = '3683'
 LIMIT 1
---
    public function getCustomer()
    {
        try {
            $UsersModel = new UsersModel();
            $user_id = $this->request->getGet('user_id');
            if (isset($user_id)) {
                $UsersModel->where('id', $user_id);
                $result = $UsersModel->find();
                $userAddressModel = new UserAddressesModel();
                $CountriesModels = new CountriesModel();
                $StatesModels = new StatesModel();
                $CitiesModels = new CitiesModel();
                $userId = $user_id;
                $userAddresses = $userAddressModel->getUserAddressDetails($userId);
                $userAddressDetails = [];
                foreach ($userAddresses as $response) {
                    $CountriesModels->where('id', $response['country_id']);
                    $StatesModels->where('id', $response['state_id']);
                    $CitiesModels->where('id', $response['city_id']);

                    $userAddressDetails[] = [
                        'id' => $response['id'],
                        'title' => $response['title'],
                        'user_id' => $response['user_id'],
                        'street' => $response['address'],
                        'city' => $CitiesModels->first(),
                        'city_id' => $response['city_id'],
                        'pincode' => $response['pincode'],
                        'is_default' => $response['is_default'],
                        'country_code' => isset($response['country_code']) ? $response['country_code'] : null,
                        'phone' => $response['phone'],
                        'country_id' => $response['country_id'],
                        'state_id' => $response['state_id'],
                        'country' => $CountriesModels->first(),
                        'state' => $StatesModels->first(),
                        'type' => $response['type']
                    ];

SELECT *
FROM `states`
---
    public function getStates()
    {
        try {
            $StatesModels = new StatesModel();
            $data = $StatesModels->findAll();

SELECT *
FROM `cities`
---
    public function getcities()
    {
        try {
            $CitiesModels = new CitiesModel();
            $data = $CitiesModels->findAll();

SELECT *
FROM `countries`
---
    public function getcountries()
    {
        try {
            $countriesModels = new countriesModel();
            $data = $countriesModels->findAll();