app/Controllers/api/GeneralSettingController.php

SELECT *
FROM `system_settings`
---
public function getSettings()
{
    $System_settingsModels = new System_settingsModel();
    $MediaModel = new MediaModel();
    $data = $System_settingsModels->findAll();