app/Controllers/api/ProductCategorieController.php

    public function getCategories()
    {
        try {
            $CategoriesModels = new CategoriesModel();
            $mediaModel = new Media_managersModel();
            $data = $CategoriesModels->findAll();
            $resposneData = [];

            foreach ($data as $resposne) {

                $img = $mediaModel->find($resposne['thumbnail_image']);
---
SELECT *
FROM `categories`
SELECT *
FROM `media_managers`
WHERE `media_managers`.`id` = '611'

    public function getProducts()
    {
        try {
            $productsModel = new ProductsModel();
            $variationModel = new VariationMasterModel();
            $productVariationsModel = new ProductVariationsModel();
            $productSelectedVariationsModel = new ProductSelectedVariationsModel();
            $variationMasterModel = new VariationTypeModel();
            $mediaModel = new Media_managersModel();
            $productvarstockModel = new ProductVariationStocksModel();

            $productsModel
            // ->where('stock_qty >', 0)
                          ->where('is_published', 1)
                          ->where('is_deleted', 0);
            $products = $productsModel->findAll();

            $responseData = [];

            foreach ($products as $product) {
                $mediaModel->where('id', $product['thumbnail_image']);
                $imageUrl = $mediaModel->findAll();
---
SELECT *
FROM `products`
WHERE `is_published` = 1
AND `is_deleted` = 0
SELECT *
FROM `media_managers`
WHERE `id` = '573'

    public function getwishlistProducts()
    {
        try {
            $user_id = $this->request->getGet('user_id');

            $wishlistModels = new WishlistsModel();

            $wishlistModels->where('user_id', $user_id);

            $wishlist = $wishlistModels->findAll();
---
SELECT *
FROM `wishlists`
WHERE `user_id` = ''